---
kind: method
id: M:Autodesk.Revit.DB.ElementRecord.GetDesignOptionId
source: html/5bbbca1e-5577-1ce0-6d74-01809d084d21.htm
---
# Autodesk.Revit.DB.ElementRecord.GetDesignOptionId Method

Gets the design option id of the element record.

## Syntax (C#)
```csharp
public ElementId GetDesignOptionId()
```

## Returns
The design option id.